In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['owais', 'aadish', 'saif', 'anas'],
    "marks":[99, 45, 29, 41],
    "city":['saharanpur', 'shamli', 'delhi', 'deoband']
    
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks        city
0   owais     99  saharanpur
1  aadish     45      shamli
2    saif     29       delhi
3    anas     41     deoband

In [5]:
df.to_csv('freind.csv')

In [6]:
df.to_csv('friends_indefalse_csv', index=False)

In [10]:
df.head(3)

     name  marks        city
0   owais     99  saharanpur
1  aadish     45      shamli
2    saif     29       delhi

In [11]:
df.describe()

           marks
count   4.000000
mean   53.500000
std    31.085902
min    29.000000
25%    38.000000
50%    43.000000
75%    58.500000
max    99.000000

In [13]:
df.tail(1)

   name  marks     city
3  anas     41  deoband

In [20]:
df['marks'][0]

99

In [22]:
df['marks'][0] = 40

C:\Users\mohdo\AppData\Local\Temp\ipykernel_18236\3127986578.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['marks'][0] = 40

In [23]:
df

     name  marks        city
0   owais     40  saharanpur
1  aadish     45      shamli
2    saif     29       delhi
3    anas     41     deoband

In [28]:
df.index = ['first', 'second', 'third', 'fourth']

In [29]:
df

          name  marks        city
first    owais     40  saharanpur
second  aadish     45      shamli
third     saif     29       delhi
fourth    anas     41     deoband

In [30]:
ser = pd.Series(np.random.rand(35))

In [32]:
type(ser)

pandas.core.series.Series

In [34]:
newdf = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334))

In [36]:
newdf

            0         1         2         3         4
0    0.406057  0.828904  0.349962  0.227394  0.905384
1    0.658990  0.258113  0.291691  0.751343  0.473050
2    0.456946  0.939641  0.246010  0.253220  0.071133
3    0.226815  0.407433  0.185034  0.375730  0.927262
4    0.182449  0.840120  0.202041  0.731245  0.243812
..        ...       ...       ...       ...       ...
329  0.579985  0.856536  0.293418  0.434234  0.237632
330  0.358726  0.367792  0.566118  0.154135  0.088266
331  0.289301  0.213840  0.381655  0.319281  0.285192
332  0.511930  0.168148  0.333518  0.921157  0.253060
333  0.069186  0.382606  0.124989  0.689536  0.037331

[334 rows x 5 columns]

In [37]:
type(newdf)

pandas.core.frame.DataFrame

In [38]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.491061    0.497837    0.496862    0.511861    0.502281
std      0.282634    0.285075    0.290054    0.287299    0.281337
min      0.000023    0.004510    0.004564    0.000139    0.008463
25%      0.262754    0.258492    0.247586    0.267522    0.263310
50%      0.457338    0.474110    0.494779    0.507764    0.494423
75%      0.718460    0.725228    0.747452    0.744123    0.739719
max      0.996147    0.999783    0.999983    0.998243    0.999942

In [39]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [40]:
newdf[0][0] = "owais"

In [41]:
newdf.head()

          0         1         2         3         4
0     owais  0.828904  0.349962  0.227394  0.905384
1   0.65899  0.258113  0.291691  0.751343  0.473050
2  0.456946  0.939641  0.246010  0.253220  0.071133
3  0.226815  0.407433  0.185034  0.375730  0.927262
4  0.182449  0.840120  0.202041  0.731245  0.243812

In [44]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [45]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [46]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [47]:
newdf.to_numpy()

array([['owais', 0.8289037030181055, 0.34996199436487463,
        0.2273939987245398, 0.9053839978063243],
       [0.658989912482723, 0.2581131352097247, 0.29169142889917654,
        0.7513426805113009, 0.4730496652627766],
       [0.456946297288912, 0.9396412146542924, 0.2460098380791419,
        0.25321950429236817, 0.07113321851967491],
       ...,
       [0.28930111530717106, 0.21383994975203424, 0.38165533988520495,
        0.3192805642255192, 0.2851924686641554],
       [0.5119295856161957, 0.16814786169460172, 0.3335176502773607,
        0.9211570204870334, 0.2530597844012916],
       [0.06918607383558972, 0.3826064404067334, 0.12498896628706191,
        0.6895358147448238, 0.037331114383974184]], dtype=object)

In [48]:
newdf[0][0] = 34

In [50]:
newdf.head()

          0         1         2         3         4
0        34  0.828904  0.349962  0.227394  0.905384
1   0.65899  0.258113  0.291691  0.751343  0.473050
2  0.456946  0.939641  0.246010  0.253220  0.071133
3  0.226815  0.407433  0.185034  0.375730  0.927262
4  0.182449  0.840120  0.202041  0.731245  0.243812

In [51]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,34,0.65899,0.456946,0.226815,0.182449,0.965294,0.70086,0.219696,0.946454,0.954802,...,0.652282,0.863241,0.769064,0.375347,0.068468,0.579985,0.358726,0.289301,0.51193,0.069186
1,0.828904,0.258113,0.939641,0.407433,0.84012,0.035667,0.937137,0.77533,0.964041,0.260448,...,0.553481,0.468516,0.27569,0.082834,0.669752,0.856536,0.367792,0.21384,0.168148,0.382606
2,0.349962,0.291691,0.24601,0.185034,0.202041,0.870568,0.448469,0.774515,0.807655,0.35164,...,0.597536,0.04384,0.289525,0.094529,0.343922,0.293418,0.566118,0.381655,0.333518,0.124989
3,0.227394,0.751343,0.25322,0.37573,0.731245,0.936735,0.660557,0.645902,0.613649,0.777472,...,0.40856,0.7298,0.329655,0.839038,0.964016,0.434234,0.154135,0.319281,0.921157,0.689536
4,0.905384,0.47305,0.071133,0.927262,0.243812,0.828109,0.388245,0.579093,0.157752,0.769023,...,0.67856,0.726681,0.937936,0.749535,0.636344,0.237632,0.088266,0.285192,0.25306,0.037331

In [53]:
newdf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333  0.069186  0.382606  0.124989  0.689536  0.037331
332   0.51193  0.168148  0.333518  0.921157  0.253060
331  0.289301  0.213840  0.381655  0.319281  0.285192
330  0.358726  0.367792  0.566118  0.154135  0.088266
329  0.579985  0.856536  0.293418  0.434234  0.237632
..        ...       ...       ...       ...       ...
4    0.182449  0.840120  0.202041  0.731245  0.243812
3    0.226815  0.407433  0.185034  0.375730  0.927262
2    0.456946  0.939641  0.246010  0.253220  0.071133
1     0.65899  0.258113  0.291691  0.751343  0.473050
0          34  0.828904  0.349962  0.227394  0.905384

[334 rows x 5 columns]

In [57]:
type(newdf[0])

pandas.core.series.Series

In [71]:
newdf2 = newdf.copy()

In [72]:
newdf2[0][0] = 857

C:\Users\mohdo\AppData\Local\Temp\ipykernel_18236\157081290.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = 857

In [73]:
newdf

        0         1         2         3         4
0    8578  0.828904  0.349962  0.227394  0.905384
1    8578  0.258113  0.291691  0.751343  0.473050
2    8578  0.939641  0.246010  0.253220  0.071133
3    8578  0.407433  0.185034  0.375730  0.927262
4    8578  0.840120  0.202041  0.731245  0.243812
..    ...       ...       ...       ...       ...
329  8578  0.856536  0.293418  0.434234  0.237632
330  8578  0.367792  0.566118  0.154135  0.088266
331  8578  0.213840  0.381655  0.319281  0.285192
332  8578  0.168148  0.333518  0.921157  0.253060
333  8578  0.382606  0.124989  0.689536  0.037331

[334 rows x 5 columns]

In [74]:
newdf2

        0         1         2         3         4
0     857  0.828904  0.349962  0.227394  0.905384
1    8578  0.258113  0.291691  0.751343  0.473050
2    8578  0.939641  0.246010  0.253220  0.071133
3    8578  0.407433  0.185034  0.375730  0.927262
4    8578  0.840120  0.202041  0.731245  0.243812
..    ...       ...       ...       ...       ...
329  8578  0.856536  0.293418  0.434234  0.237632
330  8578  0.367792  0.566118  0.154135  0.088266
331  8578  0.213840  0.381655  0.319281  0.285192
332  8578  0.168148  0.333518  0.921157  0.253060
333  8578  0.382606  0.124989  0.689536  0.037331

[334 rows x 5 columns]

In [75]:
newdf.loc[0, 0] = 654

In [76]:
newdf.head(2)

      0         1         2         3         4
0   654  0.828904  0.349962  0.227394  0.905384
1  8578  0.258113  0.291691  0.751343  0.473050

In [77]:
newdf.columns = list("ABCDE")

In [79]:
newdf.head(2)

      A         B         C         D         E
0   654  0.828904  0.349962  0.227394  0.905384
1  8578  0.258113  0.291691  0.751343  0.473050

In [80]:
newdf.loc[0, 'A'] = 5654

In [81]:
newdf.head()

      A         B         C         D         E
0  5654  0.828904  0.349962  0.227394  0.905384
1  8578  0.258113  0.291691  0.751343  0.473050
2  8578  0.939641  0.246010  0.253220  0.071133
3  8578  0.407433  0.185034  0.375730  0.927262
4  8578  0.840120  0.202041  0.731245  0.243812

In [82]:
newdf.drop('E', axis=1)

        A         B         C         D
0    5654  0.828904  0.349962  0.227394
1    8578  0.258113  0.291691  0.751343
2    8578  0.939641  0.246010  0.253220
3    8578  0.407433  0.185034  0.375730
4    8578  0.840120  0.202041  0.731245
..    ...       ...       ...       ...
329  8578  0.856536  0.293418  0.434234
330  8578  0.367792  0.566118  0.154135
331  8578  0.213840  0.381655  0.319281
332  8578  0.168148  0.333518  0.921157
333  8578  0.382606  0.124989  0.689536

[334 rows x 4 columns]

In [83]:
newdf.drop(0, axis=0)

        A         B         C         D         E
1    8578  0.258113  0.291691  0.751343  0.473050
2    8578  0.939641  0.246010  0.253220  0.071133
3    8578  0.407433  0.185034  0.375730  0.927262
4    8578  0.840120  0.202041  0.731245  0.243812
5    8578  0.035667  0.870568  0.936735  0.828109
..    ...       ...       ...       ...       ...
329  8578  0.856536  0.293418  0.434234  0.237632
330  8578  0.367792  0.566118  0.154135  0.088266
331  8578  0.213840  0.381655  0.319281  0.285192
332  8578  0.168148  0.333518  0.921157  0.253060
333  8578  0.382606  0.124989  0.689536  0.037331

[333 rows x 5 columns]

In [86]:
newdf = newdf.loc[[1, 2], ['C', 'D']]

In [87]:
newdf

          C         D
1  0.291691  0.751343
2  0.246010  0.253220

In [89]:
newdf.loc[[1,], :]

          C         D
1  0.291691  0.751343

In [90]:
newdf.loc[:, ['C']]

          C
1  0.291691
2  0.246010

In [92]:
newdf.loc[(newdf['C']<0.3)]

          C         D
1  0.291691  0.751343
2  0.246010  0.253220

In [96]:
newdf.iloc[0, 1]

0.7513426805113009

In [98]:
newdf.iloc[[0,1], :]

          C         D
1  0.291691  0.751343
2  0.246010  0.253220

In [99]:
newdf

          C         D
1  0.291691  0.751343
2  0.246010  0.253220

In [101]:
newdf['C'].isnull()

1    False
2    False
Name: C, dtype: bool

In [102]:
newdf['B'] = None

In [103]:
newdf

          C         D     B
1  0.291691  0.751343  None
2  0.246010  0.253220  None

In [104]:
newdf['B'].isnull()

1    True
2    True
Name: B, dtype: bool

In [115]:
df = pd.DataFrame({"name" : ['owais', 'owais', 'saif'],
                   "toy":[np.nan, np.nan, np.nan],
                   "born":[pd.NaT, pd.Timestamp("1904-04-25"), pd.NaT]
    
})

In [116]:
df.head()

    name  toy       born
0  owais  NaN        NaT
1  owais  NaN 1904-04-25
2   saif  NaN        NaT

In [117]:
df.dropna(how='all', axis=1)

    name       born
0  owais        NaT
1  owais 1904-04-25
2   saif        NaT

In [118]:
df

    name  toy       born
0  owais  NaN        NaT
1  owais  NaN 1904-04-25
2   saif  NaN        NaT

In [120]:
df.drop_duplicates(subset=['name'], keep=False)

   name  toy born
2  saif  NaN  NaT

In [122]:
df.shape

(3, 3)

In [123]:
df.info

<bound method DataFrame.info of     name  toy       born
0  owais  NaN        NaT
1  owais  NaN 1904-04-25
2   saif  NaN        NaT>

In [124]:
df['name'].value_counts(dropna=False)

owais    2
saif     1
Name: name, dtype: int64

In [125]:
df['name'].value_counts(dropna=True)

owais    2
saif     1
Name: name, dtype: int64

In [126]:
df.isnull()

    name   toy   born
0  False  True   True
1  False  True  False
2  False  True   True

In [ ]:
# to read the excel file
# data = pd.read_excel('file_name', sheet_name='name_of_sheet')